Kown-Minhyuk/RGB-IR_Controller/RGB_IR_INTEL_REV05/SoftwarePlatform/illd_tc23x/src/ifx/SrvSw/SysSe/Comm/Ifx_Shell.c
void Ifx_Shell_execute(Ifx_Shell *shell, pchar commandLine)
{
    pchar                    args         = NULL_PTR;
    const Ifx_Shell_Command *shellCommand = Ifx_Shell_commandListFind(shell, commandLine, &args);

    if (shellCommand != NULL_PTR)
    {
        if (shellCommand->call(args, shellCommand->data, shell->io) != FALSE)
        {
            if (shell->control.sendResultCode != 0)
            {
                Ifx_Shell_writeResult(shell, Ifx_Shell_ResultCode_ok);
            }
        }
        else
        {
            if (shell->control.sendResultCode != 0)
            {
                Ifx_Shell_writeResult(shell, Ifx_Shell_ResultCode_nok);
            }
            else if (shell->control.echoError != 0)
            {
                IfxStdIf_DPipe_print(shell->io, "\r\nShell command error: %s" ENDL, commandLine);
            }
            else
            {}
        }
    }
    else
    {
        if (commandLine[0] != IFX_SHELL_NULL_CHAR)
        {
            if (shell->control.sendResultCode != 0)
            {
                Ifx_Shell_writeResult(shell, Ifx_Shell_ResultCode_unknown);
            }
            else if (shell->control.echoError != 0)
            {
                IfxStdIf_DPipe_print(shell->io, "\r\nUnknown command: %s" ENDL, commandLine);
            }
            else
            {}
        }
    }
}


/****************************************************************************************/
/* Processes escape sequences, including handling command history.                      */
/* The following escape sequences (prefix "ESC [") are supported:                       */
/* A - up     B - down      C - right     D - left                                      */
/* 1~ - HOME  2~ - INSERT   3~ - DELETE   4~ - END                                      */
/*                                                                                      */
/* Parameters:                                                                          */
/*      EscapeChar1 - First character to follow ESC [                                   */
/*      EscapeChar2 - Second character following ESC [ , if applicable                  */
/*                                                                                      */
/****************************************************************************************/
void Ifx_Shell_cmdEscapeProcess(Ifx_Shell *shell, char EscapeChar1, char EscapeChar2)
{
    Ifx_Shell_CmdLine *Cmd    = NULL_PTR; /* Command line editing state */
    char              *cmdStr = NULL_PTR; /* Cached pointer to command line being edited */
    sint32             i      = 0;        /* Loop variable */

    /* Validate parameters */
    boolean            result = (shell != NULL_PTR);

    IFX_ASSERT(IFX_VERBOSE_LEVEL_ERROR, result != FALSE);

    if (result == FALSE)
    {
        return;                 /* ERROR CASE - no thread data available! */
    }

    /* Cache command state and command line pointer */
    Cmd    = &shell->cmd;
    cmdStr = Cmd->cmdStr;

    /* Validate command line state */
    IFX_ASSERT(IFX_VERBOSE_LEVEL_ERROR, cmdStr != NULL_PTR);
    IFX_ASSERT(IFX_VERBOSE_LEVEL_ERROR, Cmd->cursor < IFX_SHELL_CMD_LINE_SIZE);
    IFX_ASSERT(IFX_VERBOSE_LEVEL_ERROR, Cmd->length < IFX_SHELL_CMD_LINE_SIZE);

    /* Switch on first character after ESC [ */
    switch (EscapeChar1)
    {
    case 'A':                  /* Up arrow */

        if (Cmd->historyItem == IFX_SHELL_CMD_HISTORY_NO_ITEM)
        {
            /* Not using list at the moment - take most recent item [0] */
            Cmd->historyItem = 0;
        }
        else
        {
            if (Cmd->historyItem < (IFX_SHELL_CMD_HISTORY_SIZE - 1))
            {
                /* If not already at oldest, go back one in list */
                Cmd->historyItem++;
            }
        }

        /* Copy text into buffer */
        strncpy(cmdStr, shell->cmdHistory[Cmd->historyItem], IFX_SHELL_CMD_LINE_SIZE);

        /* echo to screen if requested */
        if (shell->control.echo != 0)
        {
            IFX_SHELL_WRITE_BACKSPACES(Cmd->cursor)  /* Move cursor back to start */
            IFX_SHELL_WRITE_SPACES(Cmd->length)      /* Overwrite text with spaces */
            IFX_SHELL_WRITE_BACKSPACES(Cmd->length)  /* Move cursor back to start */
            IfxStdIf_DPipe_print(shell->io, cmdStr); /* Copy buffer to screen */
        }

        Cmd->cursor     = (Ifx_SizeT)strlen(cmdStr); /* Store cursor position */
        Cmd->length     = Cmd->cursor;               /* Store command line length */
        Cmd->historyAdd = FALSE;                     /* Don't add back to history unless modified */
        break;

    case 'B':                                        /* Down arrow */

        if ((Cmd->historyItem == IFX_SHELL_CMD_HISTORY_NO_ITEM) || (Cmd->historyItem == 0))
        {
            /* Not using list at the moment, or have dropped off the end - just clear command line */
            if (shell->control.echo != 0)
            {
                IFX_SHELL_WRITE_BACKSPACES(Cmd->cursor)       /* Move cursor back to start */
                IFX_SHELL_WRITE_SPACES(Cmd->length)           /* Overwrite text with spaces */
                IFX_SHELL_WRITE_BACKSPACES(Cmd->length)       /* Move cursor back to start */
            }

            Cmd->length      = 0;                             /* Reset command line length */
            Cmd->cursor      = 0;
            Cmd->historyItem = IFX_SHELL_CMD_HISTORY_NO_ITEM; /* Ensure we are not using list */
        }
        else
        {
            /* Within list - move to more recent entry */
            Cmd->historyItem--;

            /* Copy text into buffer */
            strncpy(cmdStr, shell->cmdHistory[Cmd->historyItem], IFX_SHELL_CMD_LINE_SIZE);

            if (shell->control.echo != 0)
            {
                IFX_SHELL_WRITE_BACKSPACES(Cmd->cursor)  /* Move cursor back to start */
                IFX_SHELL_WRITE_SPACES(Cmd->length)      /* Overwrite text with spaces */
                IFX_SHELL_WRITE_BACKSPACES(Cmd->length)  /* Move cursor back to start */
                IfxStdIf_DPipe_print(shell->io, cmdStr); /* Copy buffer to screen */
            }

            Cmd->cursor = (Ifx_SizeT)strlen(cmdStr);     /* Store cursor position */
            Cmd->length = Cmd->cursor;                   /* Store command line length */
        }

        Cmd->historyAdd = FALSE;
        break;

    case 'C':                  /* Right arrow */

        if (Cmd->cursor < Cmd->length)
        {
            /* Move cursor one place to right */
            IFX_SHELL_IF_ECHO(IfxStdIf_DPipe_print(shell->io, "%c", cmdStr[Cmd->cursor])) Cmd->cursor++;
        }

        break;

